swt/anforderungsanalyse.html
---
layout: page
title: Anforderungsanalyse
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Anforderungsanalyse</h2>
<div class="outline-text-2" id="text-1">
<p>
Taxonomie von Anforderungen an SW:
</p>

<ul class="org-ul">
<li><i>funktionale Anforderungen</i>: fachliche Anforderungen an eine Software
</li>
<li><i>nicht-funktionale Anforderungen</i>: technische Anforderungen an eine
Software
</li>
<li>Rahmenbedingungen
</li>
</ul>

<p>
Produkte der Anfoderungsanalyse sind: Lasten- und Pflichtenheften: s.
<a href="http://www.vdi.de/technik/fachthemen/produktion-und-logistik/fachbereiche/technische-logistik/fa302-logistikprozesse-und-it/vdi-2519-blatt-1-vorgehensweise-bei-der-erstellung-von-lastenpflichtenheften/">VDI
Richtlinie 2519 Blatt 1</a>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Lastenheft</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Beschriebung der Anfoderungen aus Kundensicht.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Pflichtenheft</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Beschreibung der Anforderungen aus Lieferantensicht.
</p>
</div>
</div>
</div>
